[M_Aster_PlotMission02 MissionDefinition]
TurnInDescription="After enlisting the help of a fallen warrior, the Vault Hunters fell victim to the Handsome Sorcerer's treachery and learned of the Queen's imprisonment. Thankfully, a new group of allies awaited them in the dwarven mines..."

[M_Aster_PlotMission02:BlowupTHEOCEAN MissionObjectiveDefinition]
ProgressMessage="Blow up the ocean"

[M_Aster_PlotMission02:CollectBloodfruitwithoutkillingtreeant MissionObjectiveDefinition]
ProgressMessage="Collect without killing treant"

[M_Aster_PlotMission02:CollectFirstBloodFruitSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Collect bloodfruits."
MissionDescriptionOverride="The queen of [place]Flamerock Refuge[-place] disappeared somewhere in [place]The Forest of Getting Eaten Alive by Trees[-place]. Eleanor the swordswoman has asked you to head into the forest and track the queen down.<br><br>Davlin, your guide through the forest, has come across a dead end. You'll allegedly need to collect some bloodfruits from the forest in order to pass."

[M_Aster_PlotMission02:CollectTwoBloodFruits MissionObjectiveDefinition]
ProgressMessage="Collect bloodfruits"

[M_Aster_PlotMission02:DefeatDragonsSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="The queen of [place]Flamerock Refuge[-place] disappeared somewhere in [place]The Forest of Being Eaten Alive by Trees[-place]. Eleanor the swordswoman has asked you to head into the forest and track the queen down.<br><br>Davlin has discovered another orcish door that can only be bypassed with the help of someone called ''the white knight.'' You'll have to find this knight in order to reach the queen.<br>The knight, as it turns out, is Roland -- or at least Tina's imaginary version of Roland. If you can help him defeat a nearby dragon, Roland will help you find the queen."

[M_Aster_PlotMission02:DefeatGhostKingSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="The queen of [place]Flamerock Refuge[-place] disappeared somewhere in [place]The Forest of Being Eaten Alive by Trees[-place]. Eleanor the swordswoman has asked you to head into the forest and track the queen down.<br><br>On the way to find the queen, you ran into the Tree of Life. Davlin -- who, in an absolutely nonsensical plot twist turned out to be the Handsome Sorcerer all along -- used a magic curse to kill the Tree of Life shortly before summoning some ghost kings to defeat you and Roland. Obviously, you'll have to destroy the ghost kings and continue your search for the Queen."

[M_Aster_PlotMission02:FindQueensTrail MissionObjectiveDefinition]
ProgressMessage="Pick up the queen's trail"

[M_Aster_PlotMission02:FindWhiteKnight MissionObjectiveDefinition]
ProgressMessage="Find white knight"

[M_Aster_PlotMission02:FindWhiteKnightSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="The queen of [place]Flamerock Refuge[-place] disappeared somewhere in [place]The Forest of Being Eaten Alive by Trees[-place]. Eleanor the swordswoman has asked you to head into the forest and track the queen down.<br><br>Davlin has discovered another orcish door that can only be bypassed with the help of someone called ''the white knight.'' You'll have to find this knight in order to reach the queen."

[M_Aster_PlotMission02:GiveBloodFruits MissionObjectiveDefinition]
ProgressMessage="Give bloodfruit to Davlin"

[M_Aster_PlotMission02:GiveBloodFruitsSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Give Davlin the bloodfruit."
MissionDescriptionOverride="The queen of [place]Flamerock Refuge[-place] disappeared somewhere in [place]The Forest of Being Eaten Alive by Trees[-place]. Eleanor the swordswoman has asked you to head into the forest and track the queen down.<br><br>On the way to find the queen, you ran into the Tree of Life. Davlin believes that if you give him some bloodfruit, he can undo the Sorcerer's curse of darkness and bring light back to the world even without the queen's help. He's asked you to hand him some bloodfruit."

[M_Aster_PlotMission02:MeetGuardNPCSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="The queen of [place]Flamerock Refuge[-place] disappeared somewhere in [place]The Forest of Being Eaten Alive by Trees[-place]. Eleanor the swordswoman has asked you to head into the forest and track the queen down.<br><br>You'll need Davlin (the gatekeeper from the village, before Torgue temporarily replaced him) to lead you to the queen -- you'd better talk to him."

[M_Aster_PlotMission02:PaintSymbolsWithBloodFruitSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Paint the orcish symbols with bloodfruit juice."

[M_Aster_PlotMission02:QueenBreadCrumb1 MissionObjectiveSetDefinition]
MissionDescriptionOverride="The queen of [place]Flamerock Refuge[-place] disappeared somewhere in [place]The Forest of Being Eaten Alive By Trees[-place]. Eleanor the swordswoman has asked you to head into the forest and track the queen down.<br><br>Upon your finding a pile of jewels on the ground, Tina identified them as belonging to the queen. Evidently, this queen -- who is so rich that she can just afford to drop jewels in the forest rather than breadcrumbs -- is trying to lead you to her. You should follow."

[M_Aster_PlotMission02:QueenBreadCrumb21 MissionObjectiveSetDefinition]
MissionSummaryOverride="Follow the queen's trail."
MissionDescriptionOverride="The queen of [place]Flamerock Refuge[-place] disappeared somewhere in [place]The Forest of Being Eaten Alive by Trees[-place]. Eleanor the swordswoman has asked you to head into the forest and track the queen down.<br><br>Upon your finding a pile of jewels on the ground, Tina identified them as belonging to the queen. Evidently, this queen -- who is so rich that she can just afford to drop jewels in the forest rather than breadcrumbs -- is trying to lead you to her. You should follow."

[M_Aster_PlotMission02:ReturnWithRolandSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="The queen of [place]Flamerock Refuge[-place] disappeared somewhere in [place]The Forest of Being Eaten Alive by Trees[-place]. Eleanor the swordswoman has asked you to head into the forest and track the queen down.<br><br>Davlin has discovered another orcish door that can only be bypassed with the help of someone called ''the white knight.'' Now that you've found this knight, you should bring him back to Davlin so you can all proceed and find the queen."

[M_Aster_PlotMission02:TalkToRoland MissionObjectiveDefinition]
ProgressMessage="Talk to white knight"

[M_Aster_PlotMission02:TalkToRolandAfterBeatingDragonSet MissionObjectiveSetDefinition]
MissionDescriptionOverride="The queen of [place]Flamerock Refuge[-place] disappeared somewhere in [place]The Forest of Being Eaten Alive by Trees[-place]. Eleanor the swordswoman has asked you to head into the forest and track the queen down.<br><br>Davlin has discovered another orcish door that can only be bypassed with the help of someone called ''the white knight.'' You've found the knight, as it turns out -- just talk to him and he should help you."
